Revit 2024 API
BuiltInFailures.MEPFabricationFailures.NotAllPartsWereConvertedUnsuportedFittingOffsets Property
 Not all parts were converted. Eccentric transitions and taps that have offsets from the center line are unsupported and cannot be converted.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId NotAllPartsWereConvertedUnsuportedFittingOffsets { get; }
Visual Basic
Public Shared ReadOnly Property NotAllPartsWereConvertedUnsuportedFittingOffsets As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ NotAllPartsWereConvertedUnsuportedFittingOffsets {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.MEPFabricationFailures Class
Autodesk.Revit.DB Namespace